#+TITLE: Emacs Pro-tips
#+URL: https://ambrevar.xyz/emacs/index.html
#+AUTHOR: lujun9972
#+TAGS: raw
#+DATE: [2018年 10月 23日 星期二 10:12:34 HKT]
#+LANGUAGE:  zh-CN
#+OPTIONS:  H:6 num:nil toc:t n:nil ::t |:t ^:nil -:nil f:t *:t <:nil


Emacs is a wild beast that takes a while to tame. Read upon the official
Emacs是一只需要一段时间才能驯服的野兽。阅读官方
documentation, learn Elisp, check out for the best third-party packages and
文档，学习Elisp，寻找最好的第三方包
learn from other users.
向其他用户学习。

Here follows a selection of subtle best practices on how to set up Emacs as well
下面是关于如何设置Emacs的一些微妙的最佳实践
as a selection of my favorite Emacs features. See my [[https://gitlab.com/ambrevar/dotfiles][dotfiles]] for my complete
作为我最喜欢的Emacs特性的选择。查看我的[[https://gitlab.com/ambrevar/dotfiles]
configuration.
配置。

Also see the [[../emacs2/index.html][follow-up article]].
还要查看[[.. ./emacs2/索引。html][后续文章中]]。

* *组织模式
:PROPERTIES:
属性:
:CUSTOM_ID: org7966e81
:CUSTOM_ID org7966e81
:END:
结束:

Last but not least, the famous [[http://orgmode.org/][Org Mode]]. It offers some impressive features,
最后但并非最不重要的是，著名的[[http://orgmode.org/][Org模式]]。它提供了一些令人印象深刻的功能，
such as seamless table manipulation (swap columns with a keystroke...) and formula
例如无缝的表操作(用击键交换列…)和公式
computation. From the manual:
计算。从手册:

#+BEGIN_EXAMPLE
Finally, just to whet your appetite for what can be done with the
fantastic `calc.el' package, here is a table that computes the Taylor
series of degree `n' at location `x' for a couple of functions.

|---+-------------+---+-----+--------------------------------------|
| | Func | n | x | Result |
|---+-------------+---+-----+--------------------------------------|
| # | exp(x) | 1 | x | 1 + x |
| # | exp(x) | 2 | x | 1 + x + x^2 / 2 |
| # | exp(x) | 3 | x | 1 + x + x^2 / 2 + x^3 / 6 |
| # | x^2+sqrt(x) | 2 | x=0 | x*(0.5 / 0) + x^2 (2 - 0.25 / 0) / 2 |
| # | x^2+sqrt(x) | 2 | x=1 | 2 + 2.5 x - 2.5 + 0.875 (x - 1)^2 |
| 0_sync_master.sh 1_add_new_article_manual.sh 1_add_new_article_newspaper.sh 2_start_translating.sh 3_continue_the_work.sh 4_finish.sh 5_pause.sh base.sh parse_url_by_manual.sh parse_url_by_newspaper.py parse_url_by_newspaper.sh project.cfg reformat.sh texput.log urls_checker.sh | tan(x) | 3 | x | 0.0175 x + 1.77e-6 x^3 |
|---+-------------+---+-----+--------------------------------------|
#+TBLFM: $5=taylor($2,$4,$3);n3
#+END_EXAMPLE

Note that the last column is computed automatically! Formulae can be computed
注意最后一列是自动计算的!公式可以计算
using the Calc mode, Elisp, or even external programs such as R or PARI/GP.
使用Calc模式，Elisp，甚至外部程序，如R或PARI/GP。
Possibilities are endless.
可能性是无限的。

Finally, you can export the end result to LaTeX, HTML, etc.
最后，您可以将最终结果导出到LaTeX、HTML等。

